---
kind: enumMember
id: F:Autodesk.Revit.DB.Analysis.SpatialFieldPrimitiveHideMode.HideWholeElement
enum: Autodesk.Revit.DB.Analysis.SpatialFieldPrimitiveHideMode
source: html/946277c7-6e1a-7f6a-7bd3-7693904e74fd.htm
---
# Autodesk.Revit.DB.Analysis.SpatialFieldPrimitiveHideMode.HideWholeElement

Hide the whole referenced element.